package lesson6;

/**
 * Создать массив типа double с размером 4. Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */
public class Exercise2 {
    public static void main(String[] args) {
        double[] array = {0.1, 0.2, 0.3, 0.4};
        System.out.println(array[0]);
    }
}
